; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob45) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate0)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear crate5)
	(at pallet7 depot0)
	(clear crate1)
	(at pallet8 depot1)
	(clear crate4)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 436)
	(at truck1 depot2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 214)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 depot2)
	(on crate0 pallet2)
	(= (weight crate0) 78)
	(at crate1 depot0)
	(on crate1 pallet7)
	(= (weight crate1) 27)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 43)
	(at crate3 distributor1)
	(on crate3 pallet6)
	(= (weight crate3) 72)
	(at crate4 depot1)
	(on crate4 pallet8)
	(= (weight crate4) 12)
	(at crate5 distributor1)
	(on crate5 crate3)
	(= (weight crate5) 36)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 pallet7)
		(on crate2 pallet0)
		(on crate3 pallet2)
		(on crate4 crate2)
		(on crate5 pallet5)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist1 crate4 pallet8 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 pallet8)
   added: (lifting hoist1 crate4) (clear pallet8)
   changed: (fuel-cost) from 0 to 1
   goals met: 2 of 6
2. (lift hoist2 crate0 pallet2 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 1 to 2
   goals met: 2 of 6
3. (load hoist2 crate0 truck1 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 78
   goals met: 2 of 6
4. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 2 to 12
   goals met: 2 of 6
5. (unload hoist4 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist4)
   added: (lifting hoist4 crate0)
   changed: (current_load truck1) from 78 to 0
   goals met: 2 of 6
6. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 12 to 22
   goals met: 2 of 6
7. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 12
   goals met: 2 of 6
8. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 22 to 32
   goals met: 2 of 6
9. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 12 to 0
   goals met: 2 of 6
10. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 32 to 42
   goals met: 2 of 6
11. (drop hoist0 crate4 crate2 depot0)
   deleted: (lifting hoist0 crate4) (clear crate2)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate2)
   goals met: 3 of 6
12. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   changed: (current_load truck1) from 0 to 78
   goals met: 3 of 6
13. (lift hoist4 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 crate3)
   added: (lifting hoist4 crate5) (clear crate3)
   changed: (fuel-cost) from 42 to 43
   goals met: 3 of 6
14. (load hoist4 crate5 truck1 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck1) (available hoist4)
   changed: (current_load truck1) from 78 to 114
   goals met: 3 of 6
15. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   changed: (fuel-cost) from 43 to 53
   goals met: 3 of 6
16. (lift hoist4 crate3 pallet6 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet6)
   added: (lifting hoist4 crate3) (clear pallet6)
   changed: (fuel-cost) from 53 to 54
   goals met: 3 of 6
17. (load hoist4 crate3 truck0 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck0) (available hoist4)
   changed: (current_load truck0) from 0 to 72
   goals met: 3 of 6
18. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 54 to 64
   goals met: 3 of 6
19. (unload hoist2 crate3 truck0 depot2)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 72 to 0
   goals met: 3 of 6
20. (unload hoist5 crate5 truck1 distributor2)
   deleted: (in crate5 truck1) (available hoist5)
   added: (lifting hoist5 crate5)
   changed: (current_load truck1) from 114 to 78
   goals met: 3 of 6
21. (drop hoist5 crate5 pallet5 distributor2)
   deleted: (lifting hoist5 crate5) (clear pallet5)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 pallet5)
   goals met: 4 of 6
22. (unload hoist5 crate0 truck1 distributor2)
   deleted: (in crate0 truck1) (available hoist5)
   added: (lifting hoist5 crate0)
   changed: (current_load truck1) from 78 to 0
   goals met: 4 of 6
23. (drop hoist5 crate0 crate5 distributor2)
   deleted: (lifting hoist5 crate0) (clear crate5)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 crate5)
   goals met: 5 of 6
24. (drop hoist2 crate3 pallet2 depot2)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 depot2) (clear crate3) (on crate3 pallet2)
   goals met: 6 of 6
